# Написать цикл для выведения на экран каждой буквы своего ФИО.

name = "Орлов Сергей Александрович"

for letter in name:
    print(letter)
